---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpatialElementCalculationLocation
source: html/7fd30928-3c45-df35-8c98-145ec89bdb68.htm
---
# SpatialElementCalculationLocation Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.